/*********************************************************************************************************************
* 本文件是STM32F10X 开源库的一部分
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 欢迎各位使用并传播本程序 但修改内容时必须保留版权声明（即本声明）
*
*
* 修改记录
* 日期              作者           备注
* 2026-01-01        Lihua      first version
********************************************************************************************************************/
/*********************************************************************************************************************
* 接线定义：
*                   ------------------------------------
*                   模块管脚            单片机管脚
*                   DAT/OUT           查看 device_dht11.h 中 DHT11_DAT_PIN 宏定义
*                   VCC               3.3V电源
*                   GND               电源地
*                   ------------------------------------
********************************************************************************************************************/
#ifndef _device_dht11_h_
#define _device_dht11_h_

#include "common_headfile.h"

//--------------------------------------------------------------------------------------------------
//引脚配置
//--------------------------------------------------------------------------------------------------
#define DHT11_DAT_PIN            (PA11)   


typedef struct
{
	uint8  humi_int;		//湿度的整数部分
	uint8  humi_deci;	 	//湿度的小数部分
	uint8  temp_int;	 	//温度的整数部分
	uint8  temp_deci;	 	//温度的小数部分
		                 
} dht11_data_struct;
extern dht11_data_struct dht11_data;



void dht11_init(void);
uint8 dht11_read_tempandhumidity(dht11_data_struct *dht11_data);



#endif 

