/*********************************************************************************************************************
* 本文件是STM32F10X 开源库的一部分
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 欢迎各位使用并传播本程序 但修改内容时必须保留版权声明（即本声明）
*
*
* 修改记录
* 日期              作者           备注
* 2026-01-01        Lihua      first version
********************************************************************************************************************/
#ifndef _device_key_h_
#define _device_key_h_

#include "common_headfile.h"

//==================================================定义 按键 基本配置================================================
// 定义按键引脚 用户可以新增可以修改 默认定义四个按键
// 定义按键顺序对应下方 key_index_enum 枚举体中定义的顺序
// 如果用户可以新增按键 那么需要同步在下方 key_index_enum 枚举体中新增按键
#define KEY_LIST                    {PB1, PB11, PB13, PB15}

#define KEY_RELEASE_LEVEL           (GPIO_HIGH)                                 // 按键的默认状态 也就是按键释放状态的电平
#define KEY_MAX_SHOCK_PERIOD        (10       )                                 // 按键消抖检测时长 单位毫秒 低于这个时长的信号会被认为是杂波抖动
#define KEY_DOUBLE_PRESS_PERIOD     (200      )                                 // 第一次与第二次按下间隔时长 单位毫秒 低于这个时长的信号会被认为是双击动作
#define KEY_LONG_PRESS_PERIOD       (1000     )                                 // 最小长按时长 单位毫秒 高于这个时长的信号会被认为是长按动作
//==================================================定义 按键 基本配置================================================


//==================================================定义 按键 参数结构体===============================================
typedef enum
{
    KEY_1,
    KEY_2,
    KEY_3,
    KEY_4,
    KEY_NUMBER,
}key_index_enum;            // 按键索引 对应上方定义的按键引脚个数 默认定义四个按键

typedef enum
{
    KEY_RELEASE,            // 按键释放状态
    KEY_SINGLE_PRESS,       // 按键单击状态
    KEY_DOUBLE_PRESS,       // 按键双击状态
    KEY_LONG_PRESS,         // 按键长按状态
	
}key_state_enum;
//==================================================定义 按键 参数结构体===============================================


//==================================================声明 按键 基础函数===============================================
void            key_scanner             (void);                                 // 按键状态扫描
key_state_enum  key_get_state           (key_index_enum key_n);                 // 获取按键状态
void            key_clear_state         (key_index_enum key_n);                 // 清除指定按键状态
void            key_clear_all_state     (void);                                 // 清除所有按键状态
void            key_init                (uint32 period);                        // 按键初始化
//==================================================声明 按键 基础函数===============================================

#endif 

