/*********************************************************************************************************************
* 本文件是STM32F10X 开源库的一部分
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 欢迎各位使用并传播本程序 但修改内容时必须保留版权声明（即本声明）
*
*
* 修改记录
* 日期              作者           备注
* 2026-01-01        Lihua      first version
********************************************************************************************************************/
/*********************************************************************************************************************
* 接线定义：
*                   ------------------------------------
*                   模块管脚            单片机管脚
*                   EN                  查看 device_esp8266.h 中 ESP8266_EN 宏定义
*                   RX                  查看 device_esp8266.h 中 ESP8266_RX 宏定义
*                   TX                  查看 device_esp8266.h 中 ESP8266_TX 宏定义
*                   VCC                 3.3V电源
*                   GND                 电源地
*                   其余引脚悬空
*                   ------------------------------------
********************************************************************************************************************/

#ifndef _device_esp8266_h_
#define _device_esp8266_h_

#include "common_headfile.h"

//--------------------------------------------------------------------------------------------------
//引脚配置
//--------------------------------------------------------------------------------------------------
#define ESP8266_EN           	 (PA2)
#define ESP8266_UART           (UART_3)
#define ESP8266_RX             (UART3_TX_PB10)                                    // ESP8266 RX串口引脚
#define ESP8266_TX             (UART3_RX_PB11)                                    // ESP8266 TX串口引脚
#define PRINT_UART           	 (DEBUG_UART_INDEX)																	// 调试信息打印口 

//--------------------------------------------------------------------------------------------------
//服务器配置
//--------------------------------------------------------------------------------------------------
#define ESP8266_WIFI_INFO   "AT+CWJAP=\"Lihua-coder\",\"1234567890\"\r\n"							//wifi的账号和密码
#define ESP8266_ONENET_INFO "AT+CIPSTART=\"TCP\",\"mqtts.heclouds.com\",1883\r\n"			//服务器地址



void esp8266_init(void);

void esp8266_clear(void);

_Bool esp8266_sendcmd(char *cmd, char *res);

void esp8266_senddata(unsigned char *data, unsigned short len);

unsigned char *esp8266_getipd(unsigned short timeout);


#endif
