/*********************************************************************************************************************
* 本文件是STM32F10X 开源库的一部分
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 欢迎各位使用并传播本程序 但修改内容时必须保留版权声明（即本声明）
*
*
* 修改记录
* 日期              作者           备注
* 2026-01-01        Lihua      first version
********************************************************************************************************************/
#ifndef _driver_adc_h_
#define _driver_adc_h_

#include "common_headfile.h"

//==================================================定义 ADC 基本配置================================================
// 定义adc引脚 用户可以新增可以修改 默认定义四个adc
// 定义adc顺序对应下方 adc_index_enum 枚举体中定义的顺序
// 如果用户可以新增adc 那么需要同步在下方 adc_index_enum 枚举体中新增adc
#define ADC_LIST                    {ADC1_CH0_PA0, ADC1_CH1_PA1, ADC1_CH2_PA2, ADC1_CH3_PA3}

// ADC_USE_DMA定义为1表示使用DMA驱动，0表示使用普通驱动
// 当更改ADC_USE_DMA定义后，需要先编译并下载程序，单片机与模块需要断电重启才能正常通讯
#define ADC_USE_DMA         (1)                                       // 默认使用 DMA 方式驱动	

typedef enum
{
    ADC_1,
    ADC_2,
    ADC_3,
    ADC_4,
    ADC_NUMBER,
}adc_index_enum;            // adc索引 对应上方定义的adc引脚个数 默认定义四个adc
//==================================================定义 ADC 基本配置================================================




//====================================================ADC 基础函数====================================================
uint16  adc_convert             (adc_index_enum adc_n);                                    // ADC转换一次
uint16  adc_mean_filter_convert (adc_index_enum adc_n, uint8 count);                       // ADC均值滤波
void adc_init (adc_resolution_enum resolution);
//====================================================ADC 基础函数====================================================




#endif

