/*********************************************************************************************************************
* 本文件是STM32F10X 开源库的一部分
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 欢迎各位使用并传播本程序 但修改内容时必须保留版权声明（即本声明）
*
*
* 修改记录
* 日期              作者           备注
* 2026-01-01        Lihua      first version
********************************************************************************************************************/
#include "driver_delay.h"
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      system 延迟初始化函数
//  返回参数      void
//  使用示例      system_delay_init();
//-------------------------------------------------------------------------------------------------------------------
void system_delay_init(void)
{
			// 72 MHz 下，1 μs 计数 72 个时钟
		SysTick->LOAD = 72 - 1;          // 1 μs 重装
		SysTick->VAL  = 0;
		SysTick->CTRL = 5;               // HCLK，不使能中断（！）
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      system 微秒 延时函数
//  参数说明      time            延时时间  单位：us
//  返回参数      void
//  使用示例      system_delay_us(100);  // 延时100微秒
//-------------------------------------------------------------------------------------------------------------------
void system_delay_us(uint32_t xus)
{
    uint32_t tick0 = SysTick->VAL;
    uint32_t ticks = xus * 72;                 /* 72 MHz */
    uint32_t delta;
    do{
        delta = (tick0 - SysTick->VAL) & 0xFFFFFFUL; /* 24 bit 向下计数器 */
    }while(delta < ticks);
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      system 毫秒 延时函数
//  参数说明      time            延时时间  单位：ms
//  返回参数      void
//  使用示例      system_delay_ms(100);  // 延时100毫秒
//-------------------------------------------------------------------------------------------------------------------
void system_delay_ms(uint32_t xms)
{
    while (xms--) system_delay_us(1000);
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      system 秒 延时函数
//  参数说明      time            延时时间  单位：s
//  返回参数      void
//  使用示例      system_delay_ms(100);  // 延时100秒
//-------------------------------------------------------------------------------------------------------------------
void system_delay_s(uint32_t xs)
{
	while(xs--)
	{
        system_delay_ms(1000);
	}
} 
